GNU gdb (GDB) 7.0-ubuntu
Copyright (C) 2009 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "i486-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /opt/openttd-1.0.0-RC1/games/openttd...done.
Attaching to program: /opt/openttd-1.0.0-RC1/games/openttd, process 15365
Reading symbols from /usr/lib/libstdc++.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libstdc++.so.6
Reading symbols from /lib/tls/i686/cmov/libpthread.so.0...(no debugging symbols found)...done.
[Thread debugging using libthread_db enabled]
[New Thread 0xb19ffb70 (LWP 15370)]
[New Thread 0xb2f0fb70 (LWP 15368)]
[New Thread 0xb3710b70 (LWP 15367)]
Loaded symbols for /lib/tls/i686/cmov/libpthread.so.0
Reading symbols from /usr/lib/libSDL-1.2.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libSDL-1.2.so.0
Reading symbols from /lib/libz.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/libz.so.1
Reading symbols from /usr/lib/liblzo2.so.2...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/liblzo2.so.2
Reading symbols from /usr/lib/libpng12.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libpng12.so.0
Reading symbols from /usr/lib/libfontconfig.so.1...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libfontconfig.so.1
Reading symbols from /usr/lib/libfreetype.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libfreetype.so.6
Reading symbols from /lib/tls/i686/cmov/libm.so.6...(no debugging symbols found)...done.
Loaded symbols for /lib/tls/i686/cmov/libm.so.6
Reading symbols from /lib/tls/i686/cmov/libc.so.6...(no debugging symbols found)...done.
Loaded symbols for /lib/tls/i686/cmov/libc.so.6
Reading symbols from /lib/libgcc_s.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/libgcc_s.so.1
Reading symbols from /lib/ld-linux.so.2...(no debugging symbols found)...done.
Loaded symbols for /lib/ld-linux.so.2
Reading symbols from /usr/lib/libasound.so.2...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libasound.so.2
Reading symbols from /lib/tls/i686/cmov/libdl.so.2...(no debugging symbols found)...done.
Loaded symbols for /lib/tls/i686/cmov/libdl.so.2
Reading symbols from /usr/lib/libdirectfb-1.2.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libdirectfb-1.2.so.0
Reading symbols from /usr/lib/libfusion-1.2.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libfusion-1.2.so.0
Reading symbols from /usr/lib/libdirect-1.2.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libdirect-1.2.so.0
Reading symbols from /lib/libexpat.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/libexpat.so.1
Reading symbols from /lib/tls/i686/cmov/librt.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/tls/i686/cmov/librt.so.1
Reading symbols from /usr/lib/libpulse.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libpulse.so.0
Reading symbols from /usr/lib/libpulsecommon-0.9.19.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libpulsecommon-0.9.19.so
Reading symbols from /usr/lib/libX11.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libX11.so.6
Reading symbols from /usr/lib/libICE.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libICE.so.6
Reading symbols from /usr/lib/libSM.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libSM.so.6
Reading symbols from /usr/lib/libXtst.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXtst.so.6
Reading symbols from /lib/libwrap.so.0...(no debugging symbols found)...done.
Loaded symbols for /lib/libwrap.so.0
Reading symbols from /usr/lib/libsndfile.so.1...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libsndfile.so.1
Reading symbols from /lib/libdbus-1.so.3...(no debugging symbols found)...done.
Loaded symbols for /lib/libdbus-1.so.3
Reading symbols from /usr/lib/libxcb.so.1...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libxcb.so.1
Reading symbols from /lib/libuuid.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/libuuid.so.1
Reading symbols from /usr/lib/libXext.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXext.so.6
Reading symbols from /lib/tls/i686/cmov/libnsl.so.1...(no debugging symbols found)...done.
Loaded symbols for /lib/tls/i686/cmov/libnsl.so.1
Reading symbols from /usr/lib/libFLAC.so.8...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libFLAC.so.8
Reading symbols from /usr/lib/libvorbisenc.so.2...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libvorbisenc.so.2
Reading symbols from /usr/lib/libvorbis.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libvorbis.so.0
Reading symbols from /usr/lib/libogg.so.0...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libogg.so.0
Reading symbols from /usr/lib/libXau.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXau.so.6
Reading symbols from /usr/lib/libXdmcp.so.6...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXdmcp.so.6
Reading symbols from /usr/lib/alsa-lib/libasound_module_pcm_pulse.so...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/alsa-lib/libasound_module_pcm_pulse.so
Reading symbols from /usr/lib/libXcursor.so.1...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXcursor.so.1
Reading symbols from /usr/lib/libXrender.so.1...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXrender.so.1
Reading symbols from /usr/lib/libXfixes.so.3...(no debugging symbols found)...done.
Loaded symbols for /usr/lib/libXfixes.so.3
0x00750422 in __kernel_vsyscall ()
(gdb) bt
#0  0x00750422 in __kernel_vsyscall ()
#1  0x0083594d in pthread_join () from /lib/tls/i686/cmov/libpthread.so.0
#2  0x00168ba8 in ?? () from /usr/lib/libSDL-1.2.so.0
#3  0x0011ebbc in SDL_WaitThread () from /usr/lib/libSDL-1.2.so.0
#4  0x00116391 in SDL_AudioQuit () from /usr/lib/libSDL-1.2.so.0
#5  0x00115815 in SDL_QuitSubSystem () from /usr/lib/libSDL-1.2.so.0
#6  0x0011642e in SDL_CloseAudio () from /usr/lib/libSDL-1.2.so.0
#7  0x083f40d5 in SoundDriver_SDL::Stop (this=0xa6f3060)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/sound/sdl_s.cpp:48
#8  0x08266576 in CrashLog::AfterCrashLogCleanup ()
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/crashlog.cpp:384
#9  0x083489f2 in HandleCrash (signum=11)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/os/unix/crashlog_unix.cpp:170
#10 <signal handler called>
#11 0x009a0a82 in std::_Rb_tree_decrement(std::_Rb_tree_node_base*) () from /usr/lib/libstdc++.so.6
#12 0x082007c6 in std::_Rb_tree_iterator<std::pair<int const, std::set<int, std::less<int>, std::allocator<int> > > >::operator-- (this=0xafb1738) at /usr/include/c++/4.4/bits/stl_tree.h:207
#13 0x081fffae in AIAbstractListSorterValueDescending::FindNext (this=0xafb1730)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:198
#14 0x082000a2 in AIAbstractListSorterValueDescending::Next (this=0xafb1730)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:214
#15 0x081fddb3 in AIAbstractList::Next (this=0xae126c0)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:443
#16 0x081edc91 in SQConvert::HelperT<int (AIAbstractList::*)(), false>::SQCall (instance=0xae126c0, 
    func=0x81fdd6c <AIAbstractList::Next()>, vm=0xa7bc870)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/../script/squirrel_helper.hpp:186
#17 0x081da70a in SQConvert::DefSQNonStaticCallback<AIAbstractList, int (AIAbstractList::*)()> (
    vm=0xa7bc870)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/../script/squirrel_helper.hpp:782
#18 0x081af09c in SQVM::CallNative (this=0xa7bc870, nclosure=0xa7c3bd8, nargs=1, stackbase=19, 
    retval=..., suspend=@0xbf975a2c)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqvm.cpp:1170
#19 0x081abc9d in SQVM::Execute (this=0xa7bc870, closure=..., target=26, nargs=-1, stackbase=-1, 
    outres=..., raiseerror=1, et=SQVM::ET_RESUME_OPENTTD)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqvm.cpp:781
#20 0x081888ae in sq_resumecatch (v=0xa7bc870, suspend=10000)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqapi.cpp:1017
#21 0x083d58d5 in Squirrel::Resume (this=0xa7babd8, suspend=10000)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/script/squirrel.cpp:193
#22 0x081d042e in AIInstance::GameLoop (this=0xa7b08b8)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/ai_instance.cpp:381
#23 0x081b3c6a in AI::GameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/ai_core.cpp:75
#24 0x08338a7e in StateGameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:1205
#25 0x08338d53 in GameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:1281
#26 0x0847663c in VideoDriver_SDL::MainLoop (this=0xa730ac8)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/video/sdl_v.cpp:578
#27 0x08337867 in ttd_main (argc=2, argv=0xbf9760a4)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:759
#28 0x08348fe0 in main (argc=2, argv=0xbf9760a4)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/os/unix/unix.cpp:257
(gdb) frame 11
#11 0x009a0a82 in std::_Rb_tree_decrement(std::_Rb_tree_node_base*) () from /usr/lib/libstdc++.so.6
(gdb) l
242	
243	#ifdef WITH_COCOA
244		cocoaSetupAutoreleasePool();
245		/* This is passed if we are launched by double-clicking */
246		if (argc >= 2 && strncmp(argv[1], "-psn", 4) == 0) {
247			argv[1] = NULL;
248			argc = 1;
249		}
250	#endif
251		CrashLog::InitialiseCrashLog();
(gdb) info local
No symbol table info available.
(gdb) info locals
No symbol table info available.
(gdb) info locals[C[C[C[C[C[C[Kfile /opt/openttd/games/openttd
A program is being debugged already.
Are you sure you want to change the file? (y or n) 
Load new symbol table from "/opt/openttd-1.0.0-RC1/games/openttd"? (y or n) Reading symbols from /opt/openttd-1.0.0-RC1/games/openttd...done.
(gdb) bt
#0  0x00750422 in __kernel_vsyscall ()
#1  0x0083594d in pthread_join () from /lib/tls/i686/cmov/libpthread.so.0
#2  0x00168ba8 in ?? () from /usr/lib/libSDL-1.2.so.0
#3  0x0011ebbc in SDL_WaitThread () from /usr/lib/libSDL-1.2.so.0
#4  0x00116391 in SDL_AudioQuit () from /usr/lib/libSDL-1.2.so.0
#5  0x00115815 in SDL_QuitSubSystem () from /usr/lib/libSDL-1.2.so.0
#6  0x0011642e in SDL_CloseAudio () from /usr/lib/libSDL-1.2.so.0
#7  0x083f40d5 in SoundDriver_SDL::Stop (this=0xa6f3060)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/sound/sdl_s.cpp:48
#8  0x08266576 in CrashLog::AfterCrashLogCleanup ()
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/crashlog.cpp:384
#9  0x083489f2 in HandleCrash (signum=11)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/os/unix/crashlog_unix.cpp:170
#10 <signal handler called>
#11 0x009a0a82 in std::_Rb_tree_decrement(std::_Rb_tree_node_base*) () from /usr/lib/libstdc++.so.6
#12 0x082007c6 in std::_Rb_tree_iterator<std::pair<int const, std::set<int, std::less<int>, std::allocator<int> > > >::operator-- (this=0xafb1738) at /usr/include/c++/4.4/bits/stl_tree.h:207
#13 0x081fffae in AIAbstractListSorterValueDescending::FindNext (this=0xafb1730)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:198
#14 0x082000a2 in AIAbstractListSorterValueDescending::Next (this=0xafb1730)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:214
#15 0x081fddb3 in AIAbstractList::Next (this=0xae126c0)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:443
#16 0x081edc91 in SQConvert::HelperT<int (AIAbstractList::*)(), false>::SQCall (instance=0xae126c0, 
    func=0x81fdd6c <AIAbstractList::Next()>, vm=0xa7bc870)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/../script/squirrel_helper.hpp:186
#17 0x081da70a in SQConvert::DefSQNonStaticCallback<AIAbstractList, int (AIAbstractList::*)()> (
    vm=0xa7bc870)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/../script/squirrel_helper.hpp:782
#18 0x081af09c in SQVM::CallNative (this=0xa7bc870, nclosure=0xa7c3bd8, nargs=1, stackbase=19, 
    retval=..., suspend=@0xbf975a2c)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqvm.cpp:1170
#19 0x081abc9d in SQVM::Execute (this=0xa7bc870, closure=..., target=26, nargs=-1, stackbase=-1, 
    outres=..., raiseerror=1, et=SQVM::ET_RESUME_OPENTTD)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqvm.cpp:781
#20 0x081888ae in sq_resumecatch (v=0xa7bc870, suspend=10000)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/3rdparty/squirrel/squirrel/sqapi.cpp:1017
#21 0x083d58d5 in Squirrel::Resume (this=0xa7babd8, suspend=10000)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/script/squirrel.cpp:193
#22 0x081d042e in AIInstance::GameLoop (this=0xa7b08b8)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/ai_instance.cpp:381
#23 0x081b3c6a in AI::GameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/ai_core.cpp:75
#24 0x08338a7e in StateGameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:1205
#25 0x08338d53 in GameLoop () at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:1281
#26 0x0847663c in VideoDriver_SDL::MainLoop (this=0xa730ac8)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/video/sdl_v.cpp:578
#27 0x08337867 in ttd_main (argc=2, argv=0xbf9760a4)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/openttd.cpp:759
#28 0x08348fe0 in main (argc=2, argv=0xbf9760a4)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/os/unix/unix.cpp:257
(gdb) frame 11
#11 0x009a0a82 in std::_Rb_tree_decrement(std::_Rb_tree_node_base*) () from /usr/lib/libstdc++.so.6
(gdb) info loc
No symbol table info available.
(gdb) l
242	
243	#ifdef WITH_COCOA
244		cocoaSetupAutoreleasePool();
245		/* This is passed if we are launched by double-clicking */
246		if (argc >= 2 && strncmp(argv[1], "-psn", 4) == 0) {
247			argv[1] = NULL;
248			argc = 1;
249		}
250	#endif
251		CrashLog::InitialiseCrashLog();
(gdb) l [K[Kframe 13
#13 0x081fffae in AIAbstractListSorterValueDescending::FindNext (this=0xafb1730)
    at /home/jeremy/tools/openttd/openttd-1.0.0-RC1/src/ai/api/ai_abstractlist.cpp:198
198				this->bucket_iter--;
(gdb) info loc
No locals.
(gdb) list
193			if (this->bucket_list_iter == this->bucket_list->begin()) {
194				if (this->bucket_iter == this->list->buckets.begin()) {
195					this->bucket_list = NULL;
196					return;
197				}
198				this->bucket_iter--;
199				this->bucket_list = &(*this->bucket_iter).second;
200				/* Go to the end of the items in the bucket */
201				this->bucket_list_iter = this->bucket_list->begin();
202				for (size_t i = this->bucket_list->size(); i > 1; i--) this->bucket_list_iter++;
(gdb) print this
$1 = (AIAbstractListSorterValueDescending * const) 0xafb1730
(gdb) print this*this
$2 = {<AIAbstractListSorter> = {_vptr.AIAbstractListSorter = 0x84a8ca8, list = 0xae126c0}, 
  bucket_iter = {_M_node = 0xaf1e55c}, bucket_list = 0xaf1e570, bucket_list_iter = {
    _M_node = 0xac82e68}, has_no_more_items = false, item_next = 218482}
(gdb) q
A debugging session is active.

	Inferior 1 [process 15365] will be detached.

Quit anyway? (y or n) Detaching from program: /opt/openttd-1.0.0-RC1/games/openttd, process 15365
